{
  "posts": [
    {
      "id": "anime-blog-summer-2023",
      "type": "animeMulti",
      "author": "Michael Reynolds",
      "datePosted": "2000-05-24 09:24:19",
      "tags": ["group review", "summer 2023", "medium"],
      "title": "Anime Blog (Summer 2023)",
      "subtitle": "A look into what I've been watching through the Summer 2023 season",
      "content": "Summer has come and gone, and this anime season is absolutely stacked. Not a super long post, but I have finally finished Breaking Bad, so I can get back to being a weeb instead of a meth head\n I also started my degree again, and will be in school continuously for about 2 years to get my Bachelor’s in professional writing. I had an AA in English, and after a bit of time off and a bit of career searching by taking a broad spectrum of classes, I’ve found that this is what I want to do. Anyways, that is to say that if you notice anything new in the coming months in terms of my writing, style, pacing, or anything else, that is why!\n Onto the rankings! But first, the rules.  Konosuba is one of my favorite anime/light novel series of all time. It takes a very generic, trope-filled genre, Isekai, and creates a ton of comedic moments, ironic humor, and pokes fun at the very genre it is. I love it. The new spinoff, Konosuba: An Explosion On This Wonderful World!, is not quite that. The irony and humor we get in Konosuba comes from following Kazuma. When our main character is Megumin, a character who is already in this Isekai world, it becomes a totally different tone. That said, it is still quite funny, purely because Megumin and Yun Yun have a very good dynamic together. Yun Yun is usually the laughingstock of Konosuba but this spinoff gives her a lot more credit as a character. Essentially, this is just Megumin’s backstory. It’s good, but not nearly at the level of Konosuba.  Verdict: A That one marriage anime, it is Tonikaku Kawaii again! The second season is alright. Season 1 had a lot of tension and drama in it, to give a nice balance to the very wholesome marriage that Nasa and Tsukasa have. Season 2 really lacks that drama factor, with the only dramatic point being the mysterious background of Tsukasa that keen-eyed watchers are already able to piece together. It is not bad by any means, but it is certainly worse than season 1 which had a better balance.  Verdict: From A to A-",
      "postImg": "/postimages/summerAnimeCollage.webp",
      "bannerImg": "/postimages/konosuba_banner.webp",
      "malId": ""
    },
    {
      "id": "frieren-beyond-journeys-end",
      "type": "anime",
      "author": "guy on mal",
      "datePosted": "2017-08-22 17:56:16",
      "tags": ["review", "fall 2023"],
      "title": "Frieren: Beyond Journey’s End",
      "subtitle": "The adventure is over but new life lessons await this young elf mage.",
      "content": "I really don't know how to talk about this series to be completely honest. It might have one of the strongest first 30-ish chapters in any manga I've read, but it starts to lose what makes it so special the longer it goes on.  If you've ever played DnD (or watched any sort of fantasy media) I'm sure you've run into a 500-year-old elf character, but have you ever stopped and asked yourself 'damn how would living that long actually affect you?' I had one of my friends once ask this in the middle of playing DnD once. He said 'If I can achieve so much in 20 years, and can change the world in 80 what are elves doing for 500 years? Does every elf just have a learning disability or something?' And honestly, that question has stuck with me for a while. If you lived for 1000 years, ten times longer than a human lifespan, what would still keep you on the level of regular people?  It's this question that has been stuck in my mind for about two years now that has primed me so hard to enjoy this series because I've never  actually seen the question tackled in media before. And it turns out, a story that tackles that question is super interesting. What would you do if the greatest accomplishment a human could achieve was done and gone in less than one-one-hundredth of your lifespan? What would you do if the people you achieved it with were all born and all died in less than a 10th of your lifespan? Could even form truly human connections anymore? Would you be numb to it? Or would you carry the memory of those relationships for another 500 years? What would a decade even mean to you? Much less a year, or a day.  Interesting questions right? And they're all tackled in the story... for the first 30 chapters.  I hope you can see where some disappointment would come from when they just stop talking about those things because they have to do a cliche anime test arc. I don't know about you, but I don't particularly care about seeing the Naruto chunin exams in a character drama about the emotional impacts of immortality.  At the time of writing this, I'm not completely caught up, but I am roughly another twenty chapters past the end of that arc and the story really hasn't seemed to regain its footing since this bizarre break of pace. And honestly, it's extremely disappointing.  I still have faith that by the end of this series we might still see a good payoff and discussion of the things established in the first quarter of the story, but when the middle is this bland and unfocused, I'm not sure if that ending will land nearly as hard as it will deserve to.  TL;DR, this story tackles some interesting and unique themes and ideas but loses steam when it decides to shift focus to being more action-oriented and doesn't regain its footing afterward to create a fairly bland story that deserves more clarity and focus.  7/10 because the early chapters are incredible and I could easily see the story reaching those heights again",
      "postImg": "/postimages/frieren.jpg",
      "bannerImg": "/postimages/frieren_header.jpg",
      "malId": "52991"
    },
    {
      "id": "systemic-lack-of-training-convenient-technological-advances-and-the-destruction-of-technique-knowledge-in-the-anime-industry",
      "type": "anime",
      "author": "sakurablog",
      "datePosted": "2027-04-16 10:11:00",
      "tags": ["industry"],
      "title": "Systemic Lack Of Training, “Convenient” Technological Advances, And The Destruction Of Technique & Knowledge In The Anime Industry",
      "subtitle": "This is how veterans and newcomers face an already devastating issue that only stands to get worse.",
      "content": "As the anime industry fails to properly train new generations of creators, “convenient” technological advances (whether good or not in their own right) have accelerated the loss of technique, fundamentals, and knowledge among the workforce. This is how veterans and newcomers face an already devastating issue that only stands to get worse.  When asked about the future of the anime industry in an interview for Kyoto College, veteran director Tatsuya Ishihara took a moment to ponder about the recent craze around—and fury against—the potential role of AI in animation. While many (not all) artists have expressed their worries and pushed back against aspects like the exploitation of people’s work without consent, cynical studio figureheads have been much more receptive to its adoption.  Production IG and Studio WIT CEO George Wada, notorious for an aggressive production stance and making overwork something between a point of pride and a joke, is ironically quick to invoke poor working conditions to justify his decisions or simply lie to unaware audiences to earn their sympathy. It’s no surprise, then, that he’s one to embrace AI as an inevitable force of good, to fight against brutal schedules imposed by a nebulous other. Mind you, those aren’t simply thoughtless answers given during conventions, as he already partnered with Netflix to have Studio WIT produce a short film where a portion of the backgrounds were generated through AI; judging by the results, an experiment in creating something that is visually and morally hideous in an equal manner. Other studio presidents cut from the same cloth, such as MAPPA’s Manabu Otsuka, have repeatedly stated that they consider AI worth pursuing when their application in anime is feasible. In eyes like his, this will be a way to produce anime with smaller teams—something you apparently can’t achieve with healthier schedules and better control of the scope of your projects and studio altogether, against all evidence that proves that is possible.  In contrast to that, Ishihara—who may not be as high on the ladder but still is KyoAni’s current veteran leader and a member of the company’s board of directors—was anxious about the potential consequences of embracing tech like this. He first pointed at the continuous mentorship of younger artists, the act of passing down techniques from generation to generation, as the main reason behind the studio’s consistently high-quality work. Technological disruptions can help us bypass challenges that once demanded the application of those carefully fostered techniques, but in his experience, that is a double-edged sword. To illustrate it, he brought up the depiction of one of his hobbies: train animation. Once upon a time, they were all drawn traditionally, but with the adoption of CGi people embraced that less cumbersome alternative… until virtually no one was able to draw them by hand anymore. Ishihara’s fear is to live in a world where increasingly fewer things can be expressed—not just by hand, but altogether in a way, because the choice of material is an important factor in what your work evokes.",
      "postImg": "/postimages/tech-post.jpg",
      "bannerImg": "/postimages/techpost_banner.jpg",
      "malId": ""
    },
    {
      "id": "tengoku-daimakyou",
      "type": "anime",
      "author": "sakurablog",
      "datePosted": "2007-09-12 02:42:54",
      "tags": ["review", "spring 2023"],
      "title": "Tengoku Daimakyou",
      "subtitle": "An amalgamation of talent most anime would die for, but also the duty to tackle a fascinatingly weird post-apocalyptic story",
      "content": "Creating anime for television makes an art of compromising. It’s known that resources are insufficient and that production schedules have done nothing but deteriorate—a twisted accomplishment, given how poor they were to begin with. This reality has molded, and continues to do so to this day, the way these works are created. At its best, striking creative currents have been born out of those limitations, making their shortcomings into strengths of their own; if corner-cutting is inevitable, then you might as well be artful about it, because that way you might stumble across new tools of expression. Be it the surge of effective drawing count modulation techniques, further emphasizing the staging, or more recent technological advancements that seek to marry efficiency with expression, anime does have a long history of weaponizing its weaknesses.  At its worst, though, the attempts to deal with these limitations can completely drain the life away from these works. Whether it is insufficient or misdirected compromises leading to a shoddy title that collapses under its own ambition, or an overly conservative approach leaving nothing but a sterile product, the failure to navigate these circumstances is a common downfall for TV anime. On the flip side, that should mean that given the right personnel, a high-profile production environment, and an ample schedule, a project shouldn’t really have to face fundamental challenges—but is it really that simple?",
      "postImg": "/postimages/tengoku_daimakyou.jpg",
      "bannerImg": "/postimages/tengokudaimakyou_banner.jpg",
      "malId": "53393"
    },
    {
      "id": "lycoris-recoil",
      "type": "anime",
      "author": "sakurablog",
      "datePosted": "2007-02-19 23:12:01",
      "tags": ["review", "summer 2022"],
      "title": "Lycoris Recoil",
      "subtitle": "A chaotic project that grew in an organic way with the arrival of its director, turning uncertain circumstances into the fuel for their bombastic but very personable character story",
      "content": "What’s the recipe for a truly great TV anime, an original one at that? The theory says that it must start with solid planning, establishing a cohesive worldview during pre-production, and also securing a sturdy schedule so the execution can live up to those ideas. Of course, it’s not just time you need; the necessary groundwork should also involve the studio surrounding the core staff with the right personnel, in-house or otherwise, specialists and those in support roles. Few people in the know are naïve enough to expect a cut-throat industry like anime to perfectly comply with all those demands when it comes down to it, but given its relative opacity, most viewers still find themselves assuming that things must have worked out reasonably well for what they perceive to be a high quality work. It’s not to rain on anyone’s parade that we often have to point out that this is not the case—if anything, highlighting the messiness behind the screen makes those teams’ efforts even more worthy of praise.  When it comes to the surprise hit of the year, likely betraying the assumptions of many of its fans, we’re not simply talking about deviating a bit from that theoretical recipe for success. Lycoris Recoil is a chaotically conceived series from top to bottom, one that only made its deadlines thanks to specific individuals calling their neighbors, spouses, and people on vacation, as the already overwhelmed studio never really supported the team in the way they should have. And yet, it’s a show that oozes charisma from every pore of its bright protagonist, the original title that has enamored the most people this year via word of mouth alone. Despite messy origins that led to the presence of extraneous elements in the show itself, LycoReco eventually found its identity and committed to it with such boldness that even those incoherencies ended up adding to its charm. It takes finesse to make a good anime in spite of negative circumstances, and downright magic to actually twist those problems into part of your unique appeal. And as it turns out, Shingo Adachi is a magician.",
      "postImg": "/postimages/lycoris_recoil.jpg",
      "bannerImg": "/postimages/lycorisrecoil_banner.jpg",
      "malId": "50709"
    },
    {
      "id": "word-counts-are-lame",
      "type": "other",
      "author": "Michael Reynolds",
      "datePosted": "2013-03-08 23:52:09",
      "tags": ["writing"],
      "title": "Word Counts Are Lame",
      "subtitle": "A Dive into Writing.",
      "content": "We have all had classes that are a slog. We have to write an essay, do a project, cite your sources, edit your thesis, all of that annoying work. It is very important, since many fields will have you do writing in some fashion, but other than citing sources, none of that is applicable to every field. However, something that is in nearly every class, that is almost never used in the real world, is word counts.  In case you’ve been blessed in your education, or alternatively not had much education, a word count is something most classes will use for their writing assignments. From the dreaded “5,000+ word essay”, to the small but equally annoying “200 word response” to a simple question. These often feel tedious, unnecessary, and just adding busy work to a problem. You may think that as someone who is a writing major, that types out long sentences, and actually enjoys writing essays, that I would disagree with this viewpoint of tedium.  But I don’t.  See, my viewpoint has always been that whatever sufficiently describes what you need is the best answer. If you can answer a question adequately in 50 words, all the power to you. Fluffing up your response to 100 words or 200 words is excess that might actually detract from the message. Instead of quickly sharing your thoughts or laying out the facts, it is now lodged deep in a word soup that is just there to meet the dreaded word count in order to get full credit.  A better way to implement this would be for the word count to be replaced with a sentence count. Instead of 200 words, it could be 3 setences. The whole reason that word count is a thing is because many lazy or uninterested students will write too little. However, a word count does not solve this problem like teachers and professors think it will. No matter what system you implement, slackers will write poorly thought out sentences. You’re just forcing their word goop to be 200 words instead of 30. A sentence count still makes this goop 3 sentences long, but for the people who genuinely write good stuff in a concise manner, 3 sentences now gives them some room.",
      "postImg": "/postimages/word-count.jpg",
      "bannerImg": ""
    },
    {
      "id": "lavas-s11-rd2lpl-overview",
      "type": "gaming",
      "author": "Michael Reynolds",
      "datePosted": "2021-04-09 23:23:18",
      "tags": ["pokemon", "rd2lpl"],
      "title": "Lava’s S11 RD2LPL Overview",
      "subtitle": "This was an enjoyable season for me overall!",
      "content": "I got to pick a lot of cool and powerful mons, though regrettably at the cost of not having a bug type. I won’t be making that mistake twice! Everything went very well until my last week against Heron, where I wasn’t able to innovate or adapt well enough to deal with Heron’s oppressive pokemon.  Onto my pokemon reviews!  Classic dragon design that excites the 10 year old that still lives inside of me. So glad that it got a paradox form!  Salamence. Games: 14. Items: Heavy-Duty Boots, Sharp Beak, Choice Scarf, Yache Berry. Nickname: Draco. Even though it’s super simple, it's nostalgic and Salamence was one of my favorites as a kid and this was the nickname I always used for it.  Salamence as my first pick was an interesting one. While not the worst-performing member of the team, Salamence was not the menace I expected it to be. I believe this is largely due to the power level of the league, and it simply isn’t powerful enough to reliably run a band, fast enough to run a life orb, or strong enough to run a scarf. Of course, this is a generalization, and ultimately it is too powerful for t2, but it does put our boy mence in an awkward spot. I found a lot of success running him as a reliable answer to many pokemon due to his insane coverage, and most of that comes from both sides of the attacking spectrum. So in the end, Salamence was probably not worth it as a first-overall pick, but it was still really fun to run regardless, and when he wasn’t put as the main win condition, he performed very well!  Serperior is underrated, amazing design Serperior. Games: 19. Items: Leftovers, Lum Berry, Assault Vest, Kebia Berry, Choice Specs, Metronome. Nickname: Solaris. Not a lot of relevance to Serperior as a pokemon, but the character Solaris in Pokemon Reborn is pretty high and mighty like Serperior so it fit decently.  I knew immediately that I wanted Serperior as part of my main core along with Salamence from the start, and lucky for me it was not snatched up before I could get to it. Serperior is such a menace with incredible snowball potential. Of course, many teams hard counter it by having a very easy-to-come-by 4x resistance to grass, but when they are taken out and dealt with, Serperior can run over a game like nobody’s business. It’s super flexible in terms of items, but its movepool is also total garbage aside from a few key moves like leech seed, leaf storm, and glare. Having hidden power unbanned in this gen was a huge boost for Serperior, as in many other matchups it would simply be walled by half of the dex.",
      "postImg": "/postimages/salamance.gif",
      "bannerImg": ""
    },
    {
      "id": "things-i-learned-from-pro-players",
      "type": "gaming",
      "author": "Michael Reynolds",
      "datePosted": "2020-04-08 08:19:50",
      "tags": ["dota", "replay review"],
      "title": "Things I learned from Pro Players",
      "subtitle": "I take a look at 2pro replays and an educational video to discuss things I learned by watching them.",
      "content": "Kicking off me running a weekly blog, I have decided to start with the game that has kept me addicted for 6.3k hours and counting. In this blog, I take a look at 2pro replays and an educational video to discuss things I learned by watching them. I will be alternating between a few topics from week to week, but let me know if you guys like this kind of content.  First game: 5281274000 |Player: Alliance.33 |Hero: Mars Starting with my favorite dota hero, 33 showed me a couple of things I either didn’t know or didn’t consider when playing him. For starters, he started with an orb of venom in his starting items. While not conventional to start with as he doesn’t gain effects from hitting heroes multiple times like Ursa, Slark, or Monkey King, he does have an above-average attack range to constantly proc the orb slow. Combined with a Batrider pos 4, and he was able to do a lot of harass with just auto-attacks in an otherwise hard lane, being against bloodseeker which is one of the better carries against mars.  Next, I’ve noticed many pros starting with God’s rebuke at level 1 now that it has a movement speed slow on it. I tried this out in my last 3 mars games and it was fine. I can see it being more useful than spear stun in some lane matchups, but I’ve been very accustomed to having spear level 1 so it did feel a bit awkward at first. Overall, both skills kinda do the same thing in different ways, being a way to secure last hits and harass at the same time, as well as pose kill threat. Rebuke just has a strong slow rather than a stun. I’ll need to see more replays to see in what cases specifically God’s rebuke helps secure kills.  While 33s laning stage was very standard, he did a gigabrain play. At ~6:30 the catapult wave comes to his tower and most people would just draw it back to their tower and CS under the tower. However, 33 drags the wave around the secret shop. The cart doesn’t really follow him since it’s night time, so the tower instantly kills the catapult. This results in about 100 less damage on his tower from catapult hits, which may seem small but it quickly adds up.  This is a fairly standard play for higher-level players, but especially on a hero like mars, tanking for your catapult leads to towers being taken MUCH faster once the carry is forced out of the lane.  Interestingly, 33 builds treads rather than phase boots. While not the optimal boot for mars, I can see treads’ bonus strength being helpful against the likes of bloodseeker and void spirit. Phase’s armor and bonus movement speed is still preferred in most cases though. To compensate, he takes the 8 armor talents at level 15. This results in 200 extra health (strength treads), minimal amounts of extra magic resistance and health regen, 25 attack speed, 10 damage, and 4 extra armor compared to phase. Whereas taking phase and the attack damage talent is 4 less armor, a much better active for mars, and 43 extra damage which can apply to your crit. It’s hard to say which is better, and I haven’t tried treads out yet, but it’s still really cool to see pros adapt their builds to their opponents and try new things out.",
      "postImg": "/postimages/Tundra_esports_33.webp",
      "bannerImg": ""
    },
    {
      "id": "rd2lpl-mono-bug-team-review",
      "type": "gaming",
      "author": "Michael Reynolds",
      "datePosted": "2023-12-20 04:40:48",
      "tags": ["pokemon", "rd2lpl", "monotype"],
      "title": "RD2LPL Mono Bug Team Review",
      "subtitle": "I wanted to cover my thought process behind why I did mono bug, why I picked the mons I did in draft, what my gameplans were, and overall how fun it was.",
      "content": "So why mono bug? Truth be told, I have become something of a bug-type enthusiast ever since I came back to pokemon sometime between USUM and SWSH. Even though I’m insectophobic and arachnophobic in real life, the things that make me scared of bugs IRL are not present in the pokemon. Namely, bug-type pokemon don’t usually “twitch” or “skitter” very much. I might still be afraid of something like Joltik, Ninjask, or Accelgor IRL, but a lot of pokemon have “higher intelligence” compared to real animals, where they aren’t landing on my hand and giving me a panic attack. Also having to clean my car and my entire house of spider webs every single day is annoying, but I guess if I had a Galvantula, Araqaunid, or Ariados I would have to get used to that.  Beyond that, I had recently finished the entirety of a long fangame, Pokemon Reborn, doing Monotype Bug. I was on a high from completing it, and saw a decent opportunity for it to work with the lower power level this season. If anyone is interested about my run there, I can link the reddit post I made after finishing the game in general. Bug is surprisingly easy in that game since the sheer quantity of early game encounters lets you answer most threats by leveling up one of your 18 early game bugs, and late game you have Volcarona + Scizor, nuff said.  Onto my picks!  Pick 1: Araquanid aka Drown… Taken from Amaria’s quote in Pokemon Reborn upon bringing her to 1 pokemon.  Games: 10. Items: Choice Band, Leftovers, Waterium-Z, Iapapa Berry. I knew right away that Araquanid was one of the strongest pokemon in T2 and that I needed to snatch it up immediately. This pokemon is one of my favorites, as it has so many sets it can run. Choice band sets, Bulky sets, sub + toxic sets, even scarf and specs are theoretically doable builds in the right situations! Water bubble along with this pokemon’s amazing natural bulk makes it deceptively powerful for a 454 BST mon. It is so fun catching people off guard with its wide movepool too. Mirror coat, Magic Coat, Sticky Web, and even Wide Guard in doubles. I ended up not bringing araquanid every game like I expected though. This was largely because I found that there were many water type checks, such as electric types, that I ended up having to plan around. And while Araquanid does what it does amazingly, it offers nothing against its counters other than pray it doesn’t OHKO you and slam it hard with Liquidation.",
      "postImg": "/postimages/kevinDurant.webp",
      "bannerImg": ""
    }
  ],
  "tierList": {
    "s": [
      {
        "malId": "52991",
        "grade": "s",
        "reviewId": "frieren-beyond-journeys-end"
      },
      {
        "malId": "43608",
        "grade": "s",
        "reviewId": ""
      },
      {
        "malId": "4181",
        "grade": "s",
        "reviewId": ""
      },
      {
        "malId": "28851",
        "grade": "s",
        "reviewId": ""
      },
      {
        "malId": "35180",
        "grade": "s",
        "reviewId": ""
      },
      {
        "malId": "2904",
        "grade": "s",
        "reviewId": ""
      },
      {
        "malId": "19",
        "grade": "s",
        "reviewId": ""
      },
      {
        "malId": "32281",
        "grade": "s",
        "reviewId": ""
      },
      {
        "malId": "54492",
        "grade": "s",
        "reviewId": ""
      },
      {
        "malId": "49387",
        "grade": "s",
        "reviewId": ""
      },
      {
        "malId": "52198",
        "grade": "s",
        "reviewId": ""
      },
      {
        "malId": "47917",
        "grade": "s",
        "reviewId": ""
      },
      {
        "malId": "37510",
        "grade": "s",
        "reviewId": ""
      },
      {
        "malId": "32935",
        "grade": "s",
        "reviewId": ""
      }
    ],
    "a": [
      {
        "malId": "199",
        "grade": "aplus",
        "reviewId": ""
      },
      {
        "malId": "48583",
        "grade": "aplus",
        "reviewId": ""
      },
      {
        "malId": "17074",
        "grade": "aplus",
        "reviewId": ""
      },
      {
        "malId": "37521",
        "grade": "aplus",
        "reviewId": ""
      },
      {
        "malId": "1",
        "grade": "aplus",
        "reviewId": ""
      },
      {
        "malId": "52034",
        "grade": "aplus",
        "reviewId": ""
      },
      {
        "malId": "24701",
        "grade": "aplus",
        "reviewId": ""
      },
      {
        "malId": "50172",
        "grade": "a",
        "reviewId": ""
      },
      {
        "malId": "21",
        "grade": "a",
        "reviewId": ""
      },
      {
        "malId": "48569",
        "grade": "a",
        "reviewId": ""
      },
      {
        "malId": "1575",
        "grade": "a",
        "reviewId": ""
      },
      {
        "malId": "21939",
        "grade": "aminus",
        "reviewId": ""
      },
      {
        "malId": "55690",
        "grade": "aminus",
        "reviewId": ""
      },
      {
        "malId": "245",
        "grade": "aminus",
        "reviewId": ""
      },
      {
        "malId": "45576",
        "grade": "aminus",
        "reviewId": ""
      }
    ],
    "b": [
      {
        "malId": "44074",
        "grade": "bplus",
        "reviewId": ""
      },
      {
        "malId": "46102",
        "grade": "bplus",
        "reviewId": ""
      },
      {
        "malId": "33352",
        "grade": "bplus",
        "reviewId": ""
      },
      {
        "malId": "33050",
        "grade": "b",
        "reviewId": ""
      },
      {
        "malId": "54898",
        "grade": "b",
        "reviewId": ""
      },
      {
        "malId": "431",
        "grade": "b",
        "reviewId": ""
      },
      {
        "malId": "164",
        "grade": "b",
        "reviewId": ""
      },
      {
        "malId": "34599",
        "grade": "bminus",
        "reviewId": ""
      },
      {
        "malId": "23273",
        "grade": "bminus",
        "reviewId": ""
      },
      {
        "malId": "41084",
        "grade": "bminus",
        "reviewId": ""
      },
      {
        "malId": "11665",
        "grade": "bminus",
        "reviewId": ""
      }
    ],
    "c": [
      {
        "malId": "40591",
        "grade": "cplus",
        "reviewId": ""
      },
      {
        "malId": "28891",
        "grade": "cplus",
        "reviewId": ""
      },
      {
        "malId": "2001",
        "grade": "cplus",
        "reviewId": ""
      },
      {
        "malId": "36862",
        "grade": "cplus",
        "reviewId": ""
      },
      {
        "malId": "34591",
        "grade": "c",
        "reviewId": ""
      },
      {
        "malId": "22135",
        "grade": "c",
        "reviewId": ""
      },
      {
        "malId": "35760",
        "grade": "c",
        "reviewId": ""
      },
      {
        "malId": "1535",
        "grade": "c",
        "reviewId": ""
      },
      {
        "malId": "40748",
        "grade": "cminus",
        "reviewId": ""
      },
      {
        "malId": "40748",
        "grade": "cminus",
        "reviewId": ""
      },
      {
        "malId": "42310",
        "grade": "cminus",
        "reviewId": ""
      },
      {
        "malId": "7311",
        "grade": "cminus",
        "reviewId": ""
      }
    ],
    "d": [
      {
        "malId": "31757",
        "grade": "dplus",
        "reviewId": ""
      },
      {
        "malId": "12355",
        "grade": "dplus",
        "reviewId": ""
      },
      {
        "malId": "28735",
        "grade": "dplus",
        "reviewId": ""
      },
      {
        "malId": "50265",
        "grade": "dplus",
        "reviewId": ""
      },
      {
        "malId": "7785",
        "grade": "d",
        "reviewId": ""
      },
      {
        "malId": "35737",
        "grade": "d",
        "reviewId": ""
      },
      {
        "malId": "36098",
        "grade": "d",
        "reviewId": ""
      },
      {
        "malId": "877",
        "grade": "d",
        "reviewId": ""
      },
      {
        "malId": "11741",
        "grade": "dminus",
        "reviewId": ""
      },
      {
        "malId": "40417",
        "grade": "dminus",
        "reviewId": ""
      },
      {
        "malId": "40776",
        "grade": "dminus",
        "reviewId": ""
      },
      {
        "malId": "170",
        "grade": "dminus",
        "reviewId": ""
      }
    ],
    "f": [
      {
        "malId": "38853",
        "grade": "f",
        "reviewId": ""
      },
      {
        "malId": "34449",
        "grade": "f",
        "reviewId": ""
      },
      {
        "malId": "40356",
        "grade": "f",
        "reviewId": ""
      },
      {
        "malId": "37982",
        "grade": "f",
        "reviewId": ""
      },
      {
        "malId": "38814",
        "grade": "f",
        "reviewId": ""
      },
      {
        "malId": "32606",
        "grade": "f",
        "reviewId": ""
      },
      {
        "malId": "",
        "grade": "f",
        "reviewId": ""
      }
    ]
  }
}
